# SET OPERATIONS

1. Union
2. Union All
3. Intersect
4. Except
5. Multiple Combinations

### SAMPLE DATASET

```sql
-- create temporary tables
DROP TABLE IF EXISTS names;
CREATE TEMP TABLE names AS
WITH input_data (iid, first_name, title) AS (
 VALUES
 (1, 'Kate', 'Datacated Visualizer'),
 (2, 'Eric', 'Captain SQL'),
 (3, 'Danny', 'Data Wizard Of Oz'),
 (4, 'Ben', 'Mad Scientist'),
 (5, 'Dave', 'Analytics Heretic'),
 (6, 'Ken', 'The YouTuber')
)
SELECT * FROM input_data;
```

```sql
-- inspect names table
SELECT * FROM names;
```

| iid | first_name | title                |
|-----|------------|----------------------|
| 1   | Kate       | Datacated Visualizer |
| 2   | Eric       | Captain SQL          |
| 3   | Danny      | Data Wizard Of Oz    |
| 4   | Ben        | Mad Scientist        |
| 5   | Dave       | Analytics Heretic    |
| 6   | Ken        | The YouTuber         |

### 1. UNION

![union](https://i.imgur.com/BtRURxr.png)

```sql
SELECT * FROM names where first_name = 'Danny'
UNION
SELECT * FROM names where first_name = 'Kate';
```

| iid | first_name | title                |
|-----|------------|----------------------|
| 1   | Kate       | Datacated Visualizer |
| 3   | Danny      | Data Wizard Of Oz    |

### 2. UNION ALL

![union all](https://i.imgur.com/v9kgKau.png)

```sql
SELECT * FROM names where first_name = 'Danny'
UNION ALL
SELECT * FROM names where first_name = 'Danny';
```

| iid | first_name | title             |
|-----|------------|-------------------|
| 3   | Danny      | Data Wizard Of Oz |
| 3   | Danny      | Data Wizard Of Oz |

### 3. INTERSECT

![intersect](https://i.imgur.com/vV8vXom.png)

```sql
SELECT * FROM names
INTERSECT
SELECT * FROM names where LEFT(first_name, 1) = 'K';
```

| iid | first_name | title                |
|-----|------------|----------------------|
| 1   | Kate       | Datacated Visualizer |
| 4   | Ken        | The YouTuber         |

### 4. EXCEPT

![except](https://i.imgur.com/7SuEpDi.png)

```sql
SELECT * FROM names
EXCEPT
SELECT * FROM names where LEFT(first_name, 1) = 'K';
```

| iid | first_name | title             |
|-----|------------|-------------------|
| 3   | Danny      | Data Wizard Of Oz |
| 5   | Dave       | Analytics Heretic |
| 2   | Eric       | Captain SQL       |

### 5. MULTIPLE COMBINATIONS

```sql
-- all of the set operations is executed in order from top to bottom!
SELECT * FROM names WHERE first_name = 'Danny'
UNION
SELECT * FROM names where LEFT(first_name, 1) = 'K'
EXCEPT
SELECT * FROM names where first_name = 'Kate';
```

| iid | first_name | title             |
|-----|------------|-------------------|
| 3   | Danny      | Data Wizard Of Oz |
| 4   | Ken        | The Youtuber      |